# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent
#+LANGUAGE: pt-br
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export

#+Title: Aula de Revisão da Parte #1
#+Subtitle: *INF01202*
#+Author: Prof. Lucas Mello Schnorr
#+Date: \copyleft

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames]
#+OPTIONS:   H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel.tex}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{systeme}

* Configuração                                                     :noexport:

#+BEGIN_SRC emacs-lisp
(setq org-latex-listings 'minted
      org-latex-packages-alist '(("" "minted"))
      org-latex-pdf-process
      '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
(setq org-latex-minted-options
       '(("frame" "lines")
         ("fontsize" "\\scriptsize")))
#+END_SRC

#+RESULTS:
| frame    | lines       |
| fontsize | \scriptsize |
* Simulado #1

#+BEGIN_SRC C :results output :tangle simul-p1-q1.c
#include <stdio.h>
int main ()
{
int x, i, j;
x = 8;
for (i = 2; i < 5; i++)
{
j= 3;
while (j > 0)
{
x = x+1;
j = j-1;
}
printf( "X : %5d\n", x );
}
printf("- Fim - \n");
return 0;
}
#+END_SRC

Dado o programa acima, não identado, (1) apresente os valores e formato apresentados
como saída. (2) Reescreva o programa acima de forma identada, ao lado do código,
substituindo o FOR pelo comando WHILE e o WHILE por um comando DOWHILE,
gerando as mesmas saídas.

- [X] Substituir o FOR pelo comando WHILE
- [ ] substituir o WHILE pelo comando DO-WHILE

#+BEGIN_SRC C :results output :tangle simul-p1-q1-substituir.c
#include <stdio.h>
int main ()
{
  int x, i, j;
  x = 8;
  i = 2;
  while (i < 5){

    j= 3;
    do {
      x = x+1;
      j = j-1;
    }while(j > 0);
    printf( "X : %5d\n", x );
    i++;
  }
  printf("- Fim - \n");
  return 0;
}  
#+END_SRC

#+RESULTS:
: X :    11
: X :    14
: X :    17
: - Fim -

* Simulado #2

Algoritmo e programa para identificar a maior subsequência de números
0 ou 1. Por exemplo, para a sequência

#+BEGIN_SRC bash
0 0 1 1 0 1 0 1 0 0 1 1 1 0 0 0 0 0 1 0 1 0
#+END_SRC

Deve ter como saída:
- Posição 13
- Tamanho 5
- Sequência ~0 0 0 0 0~

#+BEGIN_SRC C :results output :tangle simul-p1-q1.c
#include <stdio.h>
int main(){
  int vet[] = {0, 0, 1, 1, 0, 1, 0, 1, 0, 0,
	         1, 1, 1, 0, 0, 0, 0, 0, 1, 0,
               1, 0};
  int tam = 22;
  int i;
  int maior_tamanho = -1;
  int maior_comeco = -1;
  int comeco = 0;
  int tamanho = 1;
  int atual = vet[0];
  for (i = 1; i < tam; i++){
    if (vet[i] == atual){
      tamanho++;
      if (tamanho > maior_tamanho) {
	  maior_tamanho = tamanho;
    	  maior_comeco = comeco;
      }
    }else{
      comeco = i;
      tamanho = 1;
      atual = vet[i];
    }
//    printf("%d %d %d %d\n", vet[i], atual, comeco, tamanho);
  }
  printf ("Posição %d\n", maior_comeco);
  printf ("Tamanho %d\n", maior_tamanho);
  printf ("Sequência ");
  for (i = maior_comeco; i < (maior_comeco+maior_tamanho); i++){
    printf("%d ", vet[i]);
  }
  printf ("\n");
  return 0;
}
#+END_SRC

#+RESULTS:
: Posição 13
: Tamanho 5
: Sequência 0 0 0 0 0

